gokhangg/spectrum_analyzer_STM32F407/src/STM32F40xPeripherals.h
/*
 * Project: Hardware driver register file for STM32F4XX microcontrollers
 * Author: Gokhan Gunay, ghngunay@gmail.com
 * Copyright: (C) 2014 by Gokhan Gunay
 * License: GNU GPL v3 (see License.txt)
 */

#include "stm32f4xx.h"

#ifndef __STM32F40xPeripherals
#define __STM32F40xPeripherals
/********************************* FLASH CONTROL REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	
	/*!< FLASH access control register, Address offset: 0x00 */
	union
	{
		volatile struct
		{
			unsigned LATENCY :3;
			unsigned RESERVED :5;
			unsigned PRFTEN :1;
			unsigned ICEN :1;
			unsigned DCEN :1;
			unsigned ICRST :1;
			unsigned DCRST :1;
		} acr;
		volatile uint32_t ACR;
	};

	volatile uint32_t KEYR; /*!< FLASH key register,            Address offset: 0x04 */
	volatile uint32_t OPTKEYR; /*!< FLASH option key register,     Address offset: 0x08 */
	
	/*!< FLASH status register,         Address offset: 0x0C */
	union
	{
		volatile struct
		{
			unsigned EOP :1;
			unsigned OPERR :1;
			unsigned RESERVED :2;
			unsigned WRPERR :1;
			unsigned PGAERR :1;
			unsigned PGPERR :1;
			unsigned PGSERR :1;
			unsigned RESERVED2 :8;
			unsigned BSY :1;
		} sr;
		volatile uint32_t SR;
	};
	/*!< FLASH control register,        Address offset: 0x10 */
	union
	{
		volatile struct
		{
			unsigned PG :1;
			unsigned SER :1;
			unsigned MER :1;
			unsigned SNB :4;
			unsigned RESERVED :1;
			unsigned PSIZE :2;
			unsigned RESERVED2 :6;
			unsigned START :1;
			unsigned RESERVED3 :7;
			unsigned EOPIE :1;
			unsigned ERRIE :1;
			unsigned RESERVED4 :5;
			unsigned LOCK :1;
		} cr;
		volatile uint32_t CR;
	};
	/*!< FLASH option control register, Address offset: 0x14 */
	union
	{
		volatile struct
		{
			unsigned OPTLOCK :1;
			unsigned OPTSTRT :1;
			unsigned BOR_LEV :2;
			unsigned RESERVED :1;
			unsigned USER :3;
			unsigned RDP :8;
			unsigned nWRP :12;
		} optcr;
		volatile uint32_t OPTCR;
	};
} FLASH_Type;

#undef FLASH
#define FLASH              ((FLASH_Type *) FLASH_R_BASE)

/********************************* CRC UNIT REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	volatile uint32_t DR; /*!< CRC Data register,             Address offset: 0x00 */
	volatile uint8_t IDR; /*!< CRC Independent data register, Address offset: 0x04 */
	volatile uint8_t RESERVED0; /*!< Reserved, 0x05                                      */
	volatile uint16_t RESERVED1; /*!< Reserved, 0x06                                      */
	
	/*!< CRC Control register,          Address offset: 0x08 */
	union
	{
		volatile struct
		{
			unsigned RESET :1;
		} cr;
		volatile uint32_t CR;
	};
} CRC_Type;

#undef CRC
#define CRC                 ((CRC_Type *) CRC_BASE)

/********************************* POWER UNIT REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	/*!< PWR power control register,        Address offset: 0x00 */
	union
	{
		volatile struct
		{
			unsigned LPDS :1;
			unsigned PDDS :1;
			unsigned CWUF :1;
			unsigned CSBF :1;
			unsigned PVDE :1;
			unsigned PLS :3;
			unsigned DBP :1;
			unsigned FPDS :1;
			unsigned RESERVED :4;
			unsigned VOS :1;
		} cr;
		volatile uint32_t CR;
	};
	/*!< PWR power control/status register, Address offset: 0x04 */
	union
	{
		volatile struct
		{
			unsigned LPDS :1;
			unsigned SBF :1;
			unsigned PVDO :1;
			unsigned BRR :1;
			unsigned RESERVED :4;
			unsigned EWUP :1;
			unsigned BRE :1;
			unsigned RESERVED2 :4;
			unsigned VOSRDY :1;
		} csr;
		volatile uint32_t CSR;
	};
} PWR_Type;

#undef PWR
#define PWR                 ((PWR_Type *) PWR_BASE)

/********************************* RCC REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	/*!< RCC clock control register,                                  Address offset: 0x00 */
	union
	{
		volatile struct
		{
			unsigned HSION :1;
			unsigned HSIRDY :1;
			unsigned RESERVED :1;
			unsigned HSITRIM :5;
			unsigned HSICAL :8;
			unsigned HSEON :1;
			unsigned HSERDY :1;
			unsigned HSEBYP :1;
			unsigned CSSON :1;
			unsigned RESERVED2 :4;
			unsigned PLLON :1;
			unsigned PLLRDY :1;
			unsigned PLL2SON :1;
			unsigned PLL2SRDY :1;
		} cr;
		volatile uint32_t CR;
	};
	/*!< RCC PLL configuration register,                              Address offset: 0x04 */
	union
	{
		volatile struct
		{
			unsigned PLLM :6;
			unsigned PLLN :9;
			unsigned RESERVED :1;
			unsigned PLLP :2;
			unsigned RESERVED1 :4;
			unsigned PLLSRC :1;
			unsigned RESERVED2 :1;
			unsigned PLLQ :4;
			unsigned RESERVED3 :4;
		} pllcfgr;
		volatile uint32_t PLLCFGR;
	};
	/*!< RCC clock configuration register,                            Address offset: 0x08 */
	union
	{
		volatile struct
		{
			unsigned SW :2;
			unsigned SWS :2;
			unsigned HPRE :4;
			unsigned RESERVED :2;
			unsigned PPRE1 :3;
			unsigned PPRE2 :3;
			unsigned RTCPRE :5;
			unsigned MCO1 :2;
			unsigned I2SSRC :1;
			unsigned MCO1PRE :3;
			unsigned MCO2PRE :3;
			unsigned MCO2 :2;
		} cfgr;
		volatile uint32_t CFGR;
	};
	/*!< RCC clock interrupt register,                                Address offset: 0x0C */
	union
	{
		volatile struct
		{
			unsigned LSIRDYF :1;
			unsigned LSERDYF :1;
			unsigned HSIRDYF :1;
			unsigned HSERDYF :1;
			unsigned PLLRDYF :1;
			unsigned PLL2SRDYF :1;
			unsigned RESERVED :1;
			unsigned CSSF :1;
			unsigned LSIRDYIE :1;
			unsigned LSERDYIE :1;
			unsigned HSIRDYIE :1;
			unsigned HSERDYIE :1;
			unsigned PLLRDYIE :1;
			unsigned PLL2SRDYIE :1;
			unsigned RESERVED2 :2;
			unsigned LSIRDYC :1;
			unsigned LSERDYC :1;
			unsigned HSIRDYC :1;
			unsigned HSERDYC :1;
			unsigned PLLRDYC :1;
			unsigned PLL2SRDYC :1;
			unsigned RESERVED3 :1;
			unsigned CSSC :1;
		} cir;
		volatile uint32_t CIR;
	};
	/*!< RCC AHB1 peripheral reset register,                          Address offset: 0x10 */
	union
	{
		volatile struct
		{
			unsigned GPIOARST :1;
			unsigned GPIOBRST :1;
			unsigned GPIOCRST :1;
			unsigned GPIODRST :1;
			unsigned GPIOERST :1;
			unsigned GPIOFRST :1;
			unsigned GPIOGRST :1;
			unsigned GPIOHRST :1;
			unsigned GPIOIRST :1;
			unsigned RESERVED :3;
			unsigned CRCRST :1;
			unsigned RESERVED2 :8;
			unsigned DMA1RST :1;
			unsigned DMA2RST :1;
			unsigned RESERVED3 :2;
			unsigned ETHMACRST :1;
			unsigned RESERVED4 :3;
			unsigned OTGHSRST :1;
			unsigned RESERVED5 :2;
		} ahb1rstr;
		volatile uint32_t AHB1RSTR;
	};
	/*!< RCC AHB2 peripheral reset register,                          Address offset: 0x14 */
	union
	{
		volatile struct
		{
			unsigned DCMIRST :1;
			unsigned RESERVED :3;
			unsigned CRYPTRST :1;
			unsigned HASHRST :1;
			unsigned RNGRST :1;
			unsigned OTGFSRTS :1;
		} ahb2rstr;
		volatile uint32_t AHB2RSTR;
	};
	/*!< RCC AHB3 peripheral reset register,                          Address offset: 0x18 */
	union
	{
		volatile struct
		{
			unsigned FSMCRST :1;
		} ahb3rstr;
		volatile uint32_t AHB3RSTR;
	};
	uint32_t RESERVED0; /*!< Reserved, 0x1C                                                                    */
	/*!< RCC APB1 peripheral reset register,                          Address offset: 0x20 */
	union
	{
		volatile struct
		{
			unsigned TIM2RST :1;
			unsigned TIM3RST :1;
			unsigned TIM4RST :1;
			unsigned TIM5RST :1;
			unsigned TIM6RST :1;
			unsigned TIM7RST :1;
			unsigned TIM12RST :1;
			unsigned TIM13RST :1;
			unsigned TIM14RST :1;
			unsigned RESERVED :2;
			unsigned WWDGRST :1;
			unsigned RESERVED2 :2;
			unsigned SPI2RST :1;
			unsigned SPI3RST :1;
			unsigned RESERVED3 :1;
			unsigned USART2RST :1;
			unsigned USART3RST :1;
			unsigned UART4RST :1;
			unsigned UART5RST :1;
			unsigned I2C1RST :1;
			unsigned I2C2RST :1;
			unsigned I2C3RST :1;
			unsigned RESERVED4 :1;
			unsigned CAN1RST :1;
			unsigned CAN2RST :1;
			unsigned RESERVED5 :1;
			unsigned PWRRST :1;
			unsigned DACRST :1;
		} apb1rstr;
		volatile uint32_t APB1RSTR;
	};
	/*!< RCC APB2 peripheral reset register,                          Address offset: 0x24 */
	union
	{
		volatile struct
		{
			unsigned TIM1RST :1;
			unsigned TIM8RST :1;
			unsigned RESERVED :2;
			unsigned USART1RST :1;
			unsigned USART6RST :1;
			unsigned RESERVED2 :2;
			unsigned ADCRST :1;
			unsigned RESERVED3 :2;
			unsigned SDIORST :1;
			unsigned SPI1RST :1;
			unsigned RESERVED4 :1;
			unsigned SYSCFGRRST :1;
			unsigned RESERVED5 :1;
			unsigned TIM9RST :1;
			unsigned TIM10RST :1;
			unsigned TIM11RST :1;
		} apb2rstr;
		volatile uint32_t APB2RSTR;
	};
	uint32_t RESERVED1[2]; /*!< Reserved, 0x28-0x2C                                                               */
	/*!< RCC AHB1 peripheral clock register,                          Address offset: 0x30 */
	union
	{
		volatile struct
		{
			unsigned GPIOAEN :1;
			unsigned GPIOBEN :1;
			unsigned GPIOCEN :1;
			unsigned GPIODEN :1;
			unsigned GPIOEEN :1;
			unsigned GPIOFEN :1;
			unsigned GPIOGEN :1;
			unsigned GPIOHEN :1;
			unsigned GPIOIEN :1;
			unsigned RESERVED :2;
			unsigned CRCEN :1;
			unsigned RESERVED2 :5;
			unsigned BKPSRAMEN :1;
			unsigned RESERVED3 :2;
			unsigned CCMDATARAMEN :1;
			unsigned DMA1EN :1;
			unsigned DMA2EN :1;
			unsigned RESERVED4 :2;
			unsigned ETHMACEN :1;
			unsigned ETHMACTXEN :1;
			unsigned ETHMACRXEN :1;
			unsigned ETHMACPTPEN :1;
			unsigned OTGHSEN :1;
			unsigned OTGHSULPIEN :1;
		} ahb1enr;
		volatile uint32_t AHB1ENR;
	};

	/*!< RCC AHB2 peripheral clock register,                          Address offset: 0x34 */
	union
	{
		volatile struct
		{
			unsigned DCMIEN :1;
			unsigned RESERVED :3;
			unsigned CRYPEN :1;
			unsigned HASHEN :1;
			unsigned RNGEN :1;
			unsigned OTGFSEN :1;
		} ahb2enr;
		volatile uint32_t AHB2ENR;
	};
	/*!< RCC AHB3 peripheral clock register,                          Address offset: 0x38 */
	union
	{
		volatile struct
		{
			unsigned FSMCEN :1;
		} ahb3enr;
		volatile uint32_t AHB3ENR;
	};
	uint32_t RESERVED2; /*!< Reserved, 0x3C                                                                    */
	/*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40 */
	union
	{
		volatile struct
		{
			unsigned TIM2EN :1;
			unsigned TIM3EN :1;
			unsigned TIM4EN :1;
			unsigned TIM5EN :1;
			unsigned TIM6EN :1;
			unsigned TIM7EN :1;
			unsigned TIM12EN :1;
			unsigned TIM13EN :1;
			unsigned TIM14EN :1;
			unsigned RESERVED :2;
			unsigned WWDGEN :1;
			unsigned RESERVED2 :2;
			unsigned SPI2EN :1;
			unsigned SPI3EN :1;
			unsigned RESERVED3 :1;
			unsigned USART2EN :1;
			unsigned USART3EN :1;
			unsigned UART4EN :1;
			unsigned UART5EN :1;
			unsigned I2C1EN :1;
			unsigned I2C2EN :1;
			unsigned I2C3EN :1;
			unsigned RESERVED4 :1;
			unsigned CAN1EN :1;
			unsigned CAN2EN :1;
			unsigned RESERVED5 :1;
			unsigned PWREN :1;
			unsigned DACEN :1;
		} apb1enr;
		volatile uint32_t APB1ENR;
	};
	/*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44 */
	union
	{
		volatile struct
		{
			unsigned TIM1EN :1;
			unsigned TIM8EN :1;
			unsigned RESERVED :2;
			unsigned USART1EN :1;
			unsigned USART6EN :1;
			unsigned RESERVED2 :2;
			unsigned ADCEN :1;
			unsigned RESERVED3 :2;
			unsigned SDIOEN :1;
			unsigned SPI1EN :1;
			unsigned RESERVED4 :1;
			unsigned SYSCFGREN :1;
			unsigned RESERVED5 :1;
			unsigned TIM9EN :1;
			unsigned TIM10EN :1;
			unsigned TIM11EN :1;
		} apb2enr;
		volatile uint32_t APB2ENR;
	};
	uint32_t RESERVED3[2]; /*!< Reserved, 0x48-0x4C                                                               */
	/*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */
	union
	{
		volatile struct
		{
			unsigned GPIOALPEN :1;
			unsigned GPIOBLPEN :1;
			unsigned GPIOCLPEN :1;
			unsigned GPIODLPEN :1;
			unsigned GPIOELPEN :1;
			unsigned GPIOFLPEN :1;
			unsigned GPIOGLPEN :1;
			unsigned GPIOHLPEN :1;
			unsigned GPIOILPEN :1;
			unsigned RESERVED :2;
			unsigned CRCLPEN :1;
			unsigned RESERVED2 :5;
			unsigned BKPSRAMLPEN :1;
			unsigned RESERVED3 :2;
			unsigned CCMDATARAMLPEN :1;
			unsigned DMA1LPEN :1;
			unsigned DMA2LPEN :1;
			unsigned RESERVED4 :2;
			unsigned ETHMACLPEN :1;
			unsigned ETHMACTXLPEN :1;
			unsigned ETHMACRXLPEN :1;
			unsigned ETHMACPTPLPEN :1;
			unsigned OTGHSLPEN :1;
			unsigned OTGHSULPILPEN :1;
		} ahb1lpenr;
		volatile uint32_t AHB1LPENR;
	};
	/*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */
	union
	{
		volatile struct
		{
			unsigned DCMILPEN :1;
			unsigned RESERVED :3;
			unsigned CRYPLPEN :1;
			unsigned HASHLPEN :1;
			unsigned RNGLPEN :1;
			unsigned OTGFSLPEN :1;
		} ahb2lpenr;
		volatile uint32_t AHB2LPENR;
	};
	/*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
	union
	{
		volatile struct
		{
			unsigned FSMCLPEN :1;
		} ahb3lpenr;
		volatile uint32_t AHB3LPENR;
	};
	uint32_t RESERVED4; /*!< Reserved, 0x5C                                                                    */
	/*!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60 */
	union
	{
		volatile struct
		{
			unsigned TIM2LPEN :1;
			unsigned TIM3LPEN :1;
			unsigned TIM4LPEN :1;
			unsigned TIM5LPEN :1;
			unsigned TIM6LPEN :1;
			unsigned TIM7LPEN :1;
			unsigned TIM12LPEN :1;
			unsigned TIM13LPEN :1;
			unsigned TIM14LPEN :1;
			unsigned RESERVED :2;
			unsigned WWDGLPEN :1;
			unsigned RESERVED2 :2;
			unsigned SPI2LPEN :1;
			unsigned SPI3LPEN :1;
			unsigned RESERVED3 :1;
			unsigned USART2LPEN :1;
			unsigned USART3LPEN :1;
			unsigned UART4LPEN :1;
			unsigned UART5LPEN :1;
			unsigned I2C1LPEN :1;
			unsigned I2C2LPEN :1;
			unsigned I2C3LPEN :1;
			unsigned RESERVED4 :1;
			unsigned CAN1LPEN :1;
			unsigned CAN2LPEN :1;
			unsigned RESERVED5 :1;
			unsigned PWRLPEN :1;
			unsigned DACLPEN :1;
		} apb1lpenr;
		volatile uint32_t APB1LPENR;
	};

	/*!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64 */
	union
	{
		volatile struct
		{
			unsigned TIM1LPEN :1;
			unsigned TIM8LPEN :1;
			unsigned RESERVED :2;
			unsigned USART1LPEN :1;
			unsigned USART6LPEN :1;
			unsigned RESERVED2 :2;
			unsigned ADCLPEN :1;
			unsigned RESERVED3 :2;
			unsigned SDIOLPEN :1;
			unsigned SPI1LPEN :1;
			unsigned RESERVED4 :1;
			unsigned SYSCFGRLPEN :1;
			unsigned RESERVED5 :1;
			unsigned TIM9LPEN :1;
			unsigned TIM10LPEN :1;
			unsigned TIM11LPEN :1;
		} apb2lpenr;
		volatile uint32_t APB2LPENR;
	};
	uint32_t RESERVED5[2]; /*!< Reserved, 0x68-0x6C                                                               */
	/*!< RCC Backup domain control register,                          Address offset: 0x70 */
	union
	{
		volatile struct
		{
			unsigned LSEON :1;
			unsigned LSERDY :1;
			unsigned LSEBYP :1;
			unsigned RESERVED :5;
			unsigned RTCSEL :2;
			unsigned RESERVED2 :5;
			unsigned RTCEN :1;
			unsigned BDRST :1;
		} bdcr;
		volatile uint32_t BDCR;
	};
	/*!< RCC clock control & status register,                         Address offset: 0x74 */
	union
	{
		volatile struct
		{
			unsigned LSION :1;
			unsigned LSIRDY :1;
			unsigned RESERVED :22;
			unsigned RMVF :1;
			unsigned BORRSTF :1;
			unsigned PINRSTF :1;
			unsigned PORRSTF :1;
			unsigned SFTRSTF :1;
			unsigned IWDGRSTF :1;
			unsigned WWDGRSTF :1;
			unsigned LPWRRSTF :1;
		} csr;
		volatile uint32_t CSR;
	};
	uint32_t RESERVED6[2]; /*!< Reserved, 0x78-0x7C                                                               */
	/*!< RCC spread spectrum clock generation register,               Address offset: 0x80 */
	union
	{
		volatile struct
		{
			unsigned MODPER :12;
			unsigned INCSTEP :15;
			unsigned RESERVED :2;
			unsigned SPREADSEL :1;
			unsigned SSGEN :1;
		} sscgr;
		volatile uint32_t SSCGR;
	};
	/*!< RCC PLLI2S configuration register,                           Address offset: 0x84 */
	union
	{
		volatile struct
		{
			unsigned RESERVED :6;
			unsigned PLLI2SN :9;
			unsigned RESERVED2 :13;
			unsigned PLLI2SR :3;
		} plli2scfgr;
		volatile uint32_t PLL2I2SCFGR;
	};
	volatile uint32_t RESERVED7; /*!< RCC spread spectrum clock generation register,               Address offset: 0x88 */
	volatile uint32_t DCKCFGR; /*!< RCC PLLI2S configuration register,                           Address offset: 0x8c */
} RCC_Type;

