gokhangg/spectrum_analyzer_STM32F407/src/STM32F40xPeripherals.h
#undef RCC
#define RCC      ((RCC_Type *) RCC_BASE)

/********************************* GPIO REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	/*!< GPIO port mode register,               Address offset: 0x00      */
	union
	{
		volatile struct
		{
			unsigned MODER0 :2;
			unsigned MODER1 :2;
			unsigned MODER2 :2;
			unsigned MODER3 :2;
			unsigned MODER4 :2;
			unsigned MODER5 :2;
			unsigned MODER6 :2;
			unsigned MODER7 :2;
			unsigned MODER8 :2;
			unsigned MODER9 :2;
			unsigned MODER10 :2;
			unsigned MODER11 :2;
			unsigned MODER12 :2;
			unsigned MODER13 :2;
			unsigned MODER14 :2;
			unsigned MODER15 :2;
		} moder;
		volatile uint32_t MODER;
	};

	/*!< GPIO port output type register,        Address offset: 0x04      */
	union
	{
		volatile struct
		{
			unsigned OT0 :1;
			unsigned OT1 :1;
			unsigned OT2 :1;
			unsigned OT3 :1;
			unsigned OT4 :1;
			unsigned OT5 :1;
			unsigned OT6 :1;
			unsigned OT7 :1;
			unsigned OT8 :1;
			unsigned OT9 :1;
			unsigned OT10 :1;
			unsigned OT11 :1;
			unsigned OT12 :1;
			unsigned OT13 :1;
			unsigned OT14 :1;
			unsigned OT15 :1;
		} otyper;
		volatile uint32_t OTYPER;
	};

	/*!< GPIO port output speed register,       Address offset: 0x08      */
	union
	{
		volatile struct
		{
			unsigned OSPEEDR0 :2;
			unsigned OSPEEDR1 :2;
			unsigned OSPEEDR2 :2;
			unsigned OSPEEDR3 :2;
			unsigned OSPEEDR4 :2;
			unsigned OSPEEDR5 :2;
			unsigned OSPEEDR6 :2;
			unsigned OSPEEDR7 :2;
			unsigned OSPEEDR8 :2;
			unsigned OSPEEDR9 :2;
			unsigned OSPEEDR10 :2;
			unsigned OSPEEDR11 :2;
			unsigned OSPEEDR12 :2;
			unsigned OSPEEDR13 :2;
			unsigned OSPEEDR14 :2;
			unsigned OSPEEDR15 :2;
		} speedr;
		volatile uint32_t SPEEDR;
	};

	/*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
	union
	{
		volatile struct
		{
			unsigned PUPDR0 :2;
			unsigned PUPDR1 :2;
			unsigned PUPDR2 :2;
			unsigned PUPDR3 :2;
			unsigned PUPDR4 :2;
			unsigned PUPDR5 :2;
			unsigned PUPDR6 :2;
			unsigned PUPDR7 :2;
			unsigned PUPDR8 :2;
			unsigned PUPDR9 :2;
			unsigned PUPDR10 :2;
			unsigned PUPDR11 :2;
			unsigned PUPDR12 :2;
			unsigned PUPDR13 :2;
			unsigned PUPDR14 :2;
			unsigned PUPDR15 :2;
		} pupdr;
		volatile uint32_t PUPDR;
	};
	/*!< GPIO port input data register,         Address offset: 0x10      */
	union
	{
		volatile struct
		{
			unsigned IDR0 :1;
			unsigned IDR1 :1;
			unsigned IDR2 :1;
			unsigned IDR3 :1;
			unsigned IDR4 :1;
			unsigned IDR5 :1;
			unsigned IDR6 :1;
			unsigned IDR7 :1;
			unsigned IDR8 :1;
			unsigned IDR9 :1;
			unsigned IDR10 :1;
			unsigned IDR11 :1;
			unsigned IDR12 :1;
			unsigned IDR13 :1;
			unsigned IDR14 :1;
			unsigned IDR15 :1;
		} idr;
		volatile uint32_t IDR;
	};

	/*!< GPIO port output data register,        Address offset: 0x14      */
	union
	{
		volatile struct
		{
			unsigned ODR0 :1;
			unsigned ODR1 :1;
			unsigned ODR2 :1;
			unsigned ODR3 :1;
			unsigned ODR4 :1;
			unsigned ODR5 :1;
			unsigned ODR6 :1;
			unsigned ODR7 :1;
			unsigned ODR8 :1;
			unsigned ODR9 :1;
			unsigned ODR10 :1;
			unsigned ODR11 :1;
			unsigned ODR12 :1;
			unsigned ODR13 :1;
			unsigned ODR14 :1;
			unsigned ODR15 :1;
		} odr;
		volatile uint32_t ODR;
	};

	/*!< GPIO port bit set/reset low register,  Address offset: 0x18      */
	union
	{
		volatile struct
		{
			unsigned BS0 :1;
			unsigned BS1 :1;
			unsigned BS2 :1;
			unsigned BS3 :1;
			unsigned BS4 :1;
			unsigned BS5 :1;
			unsigned BS6 :1;
			unsigned BS7 :1;
			unsigned BS8 :1;
			unsigned BS9 :1;
			unsigned BS10 :1;
			unsigned BS11 :1;
			unsigned BS12 :1;
			unsigned BS13 :1;
			unsigned BS14 :1;
			unsigned BS15 :1;
			unsigned BR0 :1;
			unsigned BR1 :1;
			unsigned BR2 :1;
			unsigned BR3 :1;
			unsigned BR4 :1;
			unsigned BR5 :1;
			unsigned BR6 :1;
			unsigned BR7 :1;
			unsigned BR8 :1;
			unsigned BR9 :1;
			unsigned BR10 :1;
			unsigned BR11 :1;
			unsigned BR12 :1;
			unsigned BR13 :1;
			unsigned BR14 :1;
			unsigned BR15 :1;
		} bsrr;
		volatile uint32_t BSRR;
	};

	/*!< GPIO port configuration lock register, Address offset: 0x1C      */
	union
	{
		volatile struct
		{
			unsigned LCK0 :1;
			unsigned LCK1 :1;
			unsigned LCK2 :1;
			unsigned LCK3 :1;
			unsigned LCK4 :1;
			unsigned LCK5 :1;
			unsigned LCK6 :1;
			unsigned LCK7 :1;
			unsigned LCK8 :1;
			unsigned LCK9 :1;
			unsigned LCK10 :1;
			unsigned LCK11 :1;
			unsigned LCK12 :1;
			unsigned LCK13 :1;
			unsigned LCK14 :1;
			unsigned LCK15 :1;
			unsigned LCKK :1;
		} lckr;
		volatile uint32_t LCKR;
	};
	/*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
	union
	{
		volatile struct
		{
			unsigned AFRL0 :4;
			unsigned AFRL1 :4;
			unsigned AFRL2 :4;
			unsigned AFRL3 :4;
			unsigned AFRL4 :4;
			unsigned AFRL5 :4;
			unsigned AFRL6 :4;
			unsigned AFRL7 :4;
		} afrl;
		volatile uint32_t AFRL;
	};
	union
	{
		volatile struct
		{
			unsigned AFRH8 :4;
			unsigned AFRH9 :4;
			unsigned AFRH10 :4;
			unsigned AFRH11 :4;
			unsigned AFRH12 :4;
			unsigned AFRH13 :4;
			unsigned AFRH14 :4;
			unsigned AFRH15 :4;
		} afrh;
		volatile uint32_t AFRH;
	};
	
} GPIO_Type;

#undef PORTA
#undef PORTB
#undef PORTC
#undef PORTD
#undef PORTE
#undef PORTF
#undef PORTG
#undef PORTH
#undef PORTI
#define PORTA ((GPIO_Type*)GPIOA_BASE)
#define PORTB ((GPIO_Type*)GPIOB_BASE)
#define PORTC ((GPIO_Type*)GPIOC_BASE)
#define PORTD ((GPIO_Type*)GPIOD_BASE)
#define PORTE ((GPIO_Type*)GPIOE_BASE)
#define PORTF ((GPIO_Type*)GPIOF_BASE)
#define PORTG ((GPIO_Type*)GPIOG_BASE)
#define PORTH ((GPIO_Type*)GPIOH_BASE)
#define PORTI ((GPIO_Type*)GPIOI_BASE)

/********************************* SYSCFG REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	/*!< SYSCFG memory remap register,                      Address offset: 0x00      */
	union
	{
		volatile struct
		{
			unsigned MEM_MODE :2;
		} memrmp;
		volatile uint32_t MEMRMP;
	};

	/*!< SYSCFG peripheral mode configuration register,     Address offset: 0x04      */
	union
	{
		volatile struct
		{
			unsigned RESERVED :23;
			unsigned MII_RMII_SEL :1;
		} pmc;
		volatile uint32_t PMC;
	};
	/*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
	union
	{
		volatile struct
		{
			unsigned EXTI0 :4;
			unsigned EXTI1 :4;
			unsigned EXTI2 :4;
			unsigned EXTI3 :4;
		} exticr1;
		volatile uint32_t EXTICR1;
	};
	union
	{
		volatile struct
		{
			unsigned EXTI4 :4;
			unsigned EXTI5 :4;
			unsigned EXTI6 :4;
			unsigned EXTI7 :4;
		} exticr2;
		volatile uint32_t EXTICR2;
	};
	union
	{
		volatile struct
		{
			unsigned EXTI8 :4;
			unsigned EXTI9 :4;
			unsigned EXTI10 :4;
			unsigned EXTI11 :4;
		} exticr3;
		volatile uint32_t EXTICR3;
	};
	union
	{
		volatile struct
		{
			unsigned EXTI12 :4;
			unsigned EXTI13 :4;
			unsigned EXTI14 :4;
			unsigned EXTI15 :4;
		} exticr4;
		volatile uint32_t EXTICR4;
	};

	volatile uint32_t RESERVED[2]; /*!< Reserved, 0x18-0x1C                                                          */
	
	/*!< SYSCFG Compensation cell control register,         Address offset: 0x20      */
	union
	{
		volatile struct
		{
			unsigned CM_PD :4;
			unsigned RESERVED :7;
			unsigned READY :4;
		} cmpcr;
		volatile uint32_t CMPCR;
	};
} SYSCFG_Type;

