gokhangg/spectrum_analyzer_STM32F407/src/STM32F40xPeripherals.h
#undef SYSCFG
#define SYSCFG              ((SYSCFG_Type *) SYSCFG_BASE)

/********************************* DMA REGISTER DEFINITION REGION *********************************/

typedef volatile struct
{
	/*!< DMA stream x configuration register      */
	union
	{
		volatile struct
		{
			unsigned EN :1;
			unsigned DMEIE :1;
			unsigned TEIE :1;
			unsigned HTIE :1;
			unsigned TCIE :1;
			unsigned PFCTRL :1;
			unsigned DIR :2;
			unsigned CIRC :1;
			unsigned PINC :1;
			unsigned MINC :1;
			unsigned PSIZE :2;
			unsigned MSIZE :2;
			unsigned PINCOS :1;
			unsigned PL :2;
			unsigned DBM :1;
			unsigned CT :1;
			unsigned RESERVED :1;
			unsigned PBURST :2;
			unsigned MBURST :2;
			unsigned CHSEL :3;
		} cr;
		volatile uint32_t CR;
	};
	volatile uint32_t NDTR; /*!< DMA stream x number of data register     */
	volatile uint32_t PAR; /*!< DMA stream x peripheral address register */
	volatile uint32_t M0AR; /*!< DMA stream x memory 0 address register   */
	volatile uint32_t M1AR; /*!< DMA stream x memory 1 address register   */
	/*!< DMA stream x FIFO control register       */
	union
	{
		volatile struct
		{
			unsigned FTH :2;
			unsigned DMDIS :1;
			unsigned FS :2;
			unsigned RESERVED :1;
			unsigned FEIE :1;
		} fcr;
		volatile uint32_t FCR;
	};
} DMA_Stream_Type;

typedef volatile struct
{
	/*!< DMA low interrupt status register,      Address offset: 0x00 */
	union
	{
		volatile struct
		{
			unsigned FEIF0 :1;
			unsigned RESERVED :1;
			unsigned DMEIF0 :1;
			unsigned TEIF0 :1;
			unsigned HTIF0 :1;
			unsigned TCIF0 :1;
			unsigned FEIF1 :1;
			unsigned RESERVED2 :1;
			unsigned DMEIF1 :1;
			unsigned TEIF1 :1;
			unsigned HTIF1 :1;
			unsigned TCIF1 :1;
			unsigned RESERVED3 :4;
			unsigned FEIF2 :1;
			unsigned RESERVED4 :1;
			unsigned DMEIF2 :1;
			unsigned TEIF2 :1;
			unsigned HTIF2 :1;
			unsigned TCIF2 :1;
			unsigned FEIF3 :1;
			unsigned RESERVED5 :1;
			unsigned DMEIF3 :1;
			unsigned TEIF3 :1;
			unsigned HTIF3 :1;
			unsigned TCIF3 :1;
		} lisr;
		volatile uint32_t LISR;
	};
	/*!< DMA high interrupt status register,     Address offset: 0x04 */
	union
	{
		volatile struct
		{
			unsigned FEIF4 :1;
			unsigned RESERVED :1;
			unsigned DMEIF4 :1;
			unsigned TEIF4 :1;
			unsigned HTIF4 :1;
			unsigned TCIF4 :1;
			unsigned FEIF5 :1;
			unsigned RESERVED2 :1;
			unsigned DMEIF5 :1;
			unsigned TEIF5 :1;
			unsigned HTIF5 :1;
			unsigned TCIF5 :1;
			unsigned RESERVED3 :4;
			unsigned FEIF6 :1;
			unsigned RESERVED4 :1;
			unsigned DMEIF6 :1;
			unsigned TEIF6 :1;
			unsigned HTIF6 :1;
			unsigned TCIF6 :1;
			unsigned FEIF7 :1;
			unsigned RESERVED5 :1;
			unsigned DMEIF7 :1;
			unsigned TEIF7 :1;
			unsigned HTIF7 :1;
			unsigned TCIF7 :1;
		} hisr;
		volatile uint32_t HISR;
	};
	/*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
	union
	{
		volatile struct
		{
			unsigned CFEIF0 :1;
			unsigned RESERVED :1;
			unsigned CDMEIF0 :1;
			unsigned CTEIF0 :1;
			unsigned CHTIF0 :1;
			unsigned CTCIF0 :1;
			unsigned CFEIF1 :1;
			unsigned RESERVED2 :1;
			unsigned CDMEIF1 :1;
			unsigned CTEIF1 :1;
			unsigned CHTIF1 :1;
			unsigned CTCIF1 :1;
			unsigned RESERVED3 :4;
			unsigned CFEIF2 :1;
			unsigned RESERVED4 :1;
			unsigned CDMEIF2 :1;
			unsigned CTEIF2 :1;
			unsigned CHTIF2 :1;
			unsigned CTCIF2 :1;
			unsigned CFEIF3 :1;
			unsigned RESERVED5 :1;
			unsigned CDMEIF3 :1;
			unsigned CTEIF3 :1;
			unsigned CHTIF3 :1;
			unsigned CTCIF3 :1;
		} lifcr;
		volatile uint32_t LIFCR;
	};
	/*!< DMA high interrupt flag clear register, Address offset: 0x0C */
	union
	{
		volatile struct
		{
			unsigned CFEIF4 :1;
			unsigned RESERVED :1;
			unsigned CDMEIF4 :1;
			unsigned CTEIF4 :1;
			unsigned CHTIF4 :1;
			unsigned CTCIF4 :1;
			unsigned CFEIF5 :1;
			unsigned RESERVED2 :1;
			unsigned CDMEIF5 :1;
			unsigned CTEIF5 :1;
			unsigned CHTIF5 :1;
			unsigned CTCIF5 :1;
			unsigned RESERVED3 :4;
			unsigned CFEIF6 :1;
			unsigned RESERVED4 :1;
			unsigned CDMEIF6 :1;
			unsigned CTEIF6 :1;
			unsigned CHTIF6 :1;
			unsigned CTCIF6 :1;
			unsigned CFEIF7 :1;
			unsigned RESERVED5 :1;
			unsigned CDMEIF7 :1;
			unsigned CTEIF7 :1;
			unsigned CHTIF7 :1;
			unsigned CTCIF7 :1;
		} hifcr;
		volatile uint32_t HIFCR;
	};
} DMA_Type;


#undef DMA1
#undef DMA1_Stream0
#undef DMA1_Stream1
#undef DMA1_Stream2
#undef DMA1_Stream3
#undef DMA1_Stream4
#undef DMA1_Stream5
#undef DMA1_Stream6
#undef DMA1_Stream7
#undef DMA2
#undef DMA2_Stream0
#undef DMA2_Stream1
#undef DMA2_Stream2
#undef DMA2_Stream3
#undef DMA2_Stream4
#undef DMA2_Stream5
#undef DMA2_Stream6
#undef DMA2_Stream7

#define DMA1                ((DMA_Type *) DMA1_BASE)
#define DMA1_Stream0        ((DMA_Stream_Type *) DMA1_Stream0_BASE)
#define DMA1_Stream1        ((DMA_Stream_Type *) DMA1_Stream1_BASE)
#define DMA1_Stream2        ((DMA_Stream_Type *) DMA1_Stream2_BASE)
#define DMA1_Stream3        ((DMA_Stream_Type *) DMA1_Stream3_BASE)
#define DMA1_Stream4        ((DMA_Stream_Type *) DMA1_Stream4_BASE)
#define DMA1_Stream5        ((DMA_Stream_Type *) DMA1_Stream5_BASE)
#define DMA1_Stream6        ((DMA_Stream_Type *) DMA1_Stream6_BASE)
#define DMA1_Stream7        ((DMA_Stream_Type *) DMA1_Stream7_BASE)
#define DMA2                ((DMA_Type *) DMA2_BASE)
#define DMA2_Stream0        ((DMA_Stream_Type *) DMA2_Stream0_BASE)
#define DMA2_Stream1        ((DMA_Stream_Type *) DMA2_Stream1_BASE)
#define DMA2_Stream2        ((DMA_Stream_Type *) DMA2_Stream2_BASE)
#define DMA2_Stream3        ((DMA_Stream_Type *) DMA2_Stream3_BASE)
#define DMA2_Stream4        ((DMA_Stream_Type *) DMA2_Stream4_BASE)
#define DMA2_Stream5        ((DMA_Stream_Type *) DMA2_Stream5_BASE)
#define DMA2_Stream6        ((DMA_Stream_Type *) DMA2_Stream6_BASE)
#define DMA2_Stream7        ((DMA_Stream_Type *) DMA2_Stream7_BASE)

/********************************* INTERRUPT REGISTER DEFINITION REGION *********************************/

typedef struct
{
	/*!< EXTI Interrupt mask register,            Address offset: 0x00 */
	union
	{
		volatile struct
		{
			unsigned MR0 :1;
			unsigned MR1 :1;
			unsigned MR2 :1;
			unsigned MR3 :1;
			unsigned MR4 :1;
			unsigned MR5 :1;
			unsigned MR6 :1;
			unsigned MR7 :1;
			unsigned MR8 :1;
			unsigned MR9 :1;
			unsigned MR10 :1;
			unsigned MR11 :1;
			unsigned MR12 :1;
			unsigned MR13 :1;
			unsigned MR14 :1;
			unsigned MR15 :1;
			unsigned MR16 :1;
			unsigned MR17 :1;
			unsigned MR18 :1;
			unsigned MR19 :1;
			unsigned MR20 :1;
			unsigned MR21 :1;
			unsigned MR22 :1;
		} imr;
		volatile uint32_t IMR;
	};
	/*!< EXTI Event mask register,                Address offset: 0x04 */
	union
	{
		volatile struct
		{
			unsigned MR0 :1;
			unsigned MR1 :1;
			unsigned MR2 :1;
			unsigned MR3 :1;
			unsigned MR4 :1;
			unsigned MR5 :1;
			unsigned MR6 :1;
			unsigned MR7 :1;
			unsigned MR8 :1;
			unsigned MR9 :1;
			unsigned MR10 :1;
			unsigned MR11 :1;
			unsigned MR12 :1;
			unsigned MR13 :1;
			unsigned MR14 :1;
			unsigned MR15 :1;
			unsigned MR16 :1;
			unsigned MR17 :1;
			unsigned MR18 :1;
			unsigned MR19 :1;
			unsigned MR20 :1;
			unsigned MR21 :1;
			unsigned MR22 :1;
		} emr;
		volatile uint32_t EMR;
	};
	/*!< EXTI Rising trigger selection register,  Address offset: 0x08 */
	union
	{
		volatile struct
		{
			unsigned TR0 :1;
			unsigned TR1 :1;
			unsigned TR2 :1;
			unsigned TR3 :1;
			unsigned TR4 :1;
			unsigned TR5 :1;
			unsigned TR6 :1;
			unsigned TR7 :1;
			unsigned TR8 :1;
			unsigned TR9 :1;
			unsigned TR10 :1;
			unsigned TR11 :1;
			unsigned TR12 :1;
			unsigned TR13 :1;
			unsigned TR14 :1;
			unsigned TR15 :1;
			unsigned TR16 :1;
			unsigned TR17 :1;
			unsigned TR18 :1;
			unsigned TR19 :1;
			unsigned TR20 :1;
			unsigned TR21 :1;
			unsigned TR22 :1;
		} rtrs;
		volatile uint32_t RTRS;
	};

	/*!< EXTI Falling trigger selection register, Address offset: 0x0C */
	union
	{
		volatile struct
		{
			unsigned TR0 :1;
			unsigned TR1 :1;
			unsigned TR2 :1;
			unsigned TR3 :1;
			unsigned TR4 :1;
			unsigned TR5 :1;
			unsigned TR6 :1;
			unsigned TR7 :1;
			unsigned TR8 :1;
			unsigned TR9 :1;
			unsigned TR10 :1;
			unsigned TR11 :1;
			unsigned TR12 :1;
			unsigned TR13 :1;
			unsigned TR14 :1;
			unsigned TR15 :1;
			unsigned TR16 :1;
			unsigned TR17 :1;
			unsigned TR18 :1;
			unsigned TR19 :1;
			unsigned TR20 :1;
			unsigned TR21 :1;
			unsigned TR22 :1;
		} ftrs;
		volatile uint32_t FTRS;
	};

	/*!< EXTI Software interrupt event register,  Address offset: 0x10 */
	union
	{
		volatile struct
		{
			unsigned SWIER0 :1;
			unsigned SWIER1 :1;
			unsigned SWIER2 :1;
			unsigned SWIER3 :1;
			unsigned SWIER4 :1;
			unsigned SWIER5 :1;
			unsigned SWIER6 :1;
			unsigned SWIER7 :1;
			unsigned SWIER8 :1;
			unsigned SWIER9 :1;
			unsigned SWIER10 :1;
			unsigned SWIER11 :1;
			unsigned SWIER12 :1;
			unsigned SWIER13 :1;
			unsigned SWIER14 :1;
			unsigned SWIER15 :1;
			unsigned SWIER16 :1;
			unsigned SWIER17 :1;
			unsigned SWIER18 :1;
			unsigned SWIER19 :1;
			unsigned SWIER20 :1;
			unsigned SWIER21 :1;
			unsigned SWIER22 :1;
		} swier;
		volatile uint32_t SWIER;
	};

	/*!< EXTI Pending register,                   Address offset: 0x14 */
	union
	{
		volatile struct
		{
			unsigned PR0 :1;
			unsigned PR1 :1;
			unsigned PR2 :1;
			unsigned PR3 :1;
			unsigned PR4 :1;
			unsigned PR5 :1;
			unsigned PR6 :1;
			unsigned PR7 :1;
			unsigned PR8 :1;
			unsigned PR9 :1;
			unsigned PR10 :1;
			unsigned PR11 :1;
			unsigned PR12 :1;
			unsigned PR13 :1;
			unsigned PR14 :1;
			unsigned PR15 :1;
			unsigned PR16 :1;
			unsigned PR17 :1;
			unsigned PR18 :1;
			unsigned PR19 :1;
			unsigned PR20 :1;
			unsigned PR21 :1;
			unsigned PR22 :1;
		} pr;
		volatile uint32_t PR;
	};
} EXTI_Type;

#undef EXTI
#define EXTI                ((EXTI_Type *) EXTI_BASE)

/********************************* ADC REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	union
	{
		volatile struct
		{
			unsigned AWD :1;
			unsigned EOC :1;
			unsigned JEOC :1;
			unsigned JSTRT :1;
			unsigned STRT :1;
			unsigned OVR :1;
		} sr;
		volatile uint32_t SR;
	};
	union
	{
		volatile struct
		{
			unsigned AWDCH :5;
			unsigned EOCIE :1;
			unsigned AWDIE :1;
			unsigned JEOCIE :1;
			unsigned SCAN :1;
			unsigned AWDSGL :1;
			unsigned JAUTO :1;
			unsigned DISCEN :1;
			unsigned JDISCEN :1;
			unsigned DISCNUM :3;
			unsigned RESERVED :6;
			unsigned JAWDEN :1;
			unsigned AWDEN :1;
			unsigned RES :2;
			unsigned OVRIE :1;
		} cr1;
		volatile uint32_t CR1;
	};

	union
	{
		volatile struct
		{
			unsigned ADON :1;
			unsigned CONT :1;
			unsigned RESERVED :6;
			unsigned DMA :1;
			unsigned DDS :1;
			unsigned EOCS :1;
			unsigned ALIGN :1;
			unsigned RESERVED2 :4;
			unsigned JEXTSEL :4;
			unsigned JEXTSEN :2;
			unsigned JSWSTART :1;
			unsigned RESERVED3 :1;
			unsigned EXTSEL :4;
			unsigned EXTEN :2;
			unsigned SWSTART :1;
		} cr2;
		volatile uint32_t CR2;
	};
	union
	{
		volatile struct
		{
			unsigned SMP10 :3;
			unsigned SMP11 :3;
			unsigned SMP12 :3;
			unsigned SMP13 :3;
			unsigned SMP14 :3;
			unsigned SMP15 :3;
			unsigned SMP16 :3;
			unsigned SMP17 :3;
			unsigned SMP18 :3;
		} smpr1;
		volatile uint32_t SMPR1;
	};
	union
	{
		volatile struct
		{
			unsigned SMP0 :3;
			unsigned SMP1 :3;
			unsigned SMP2 :3;
			unsigned SMP3 :3;
			unsigned SMP4 :3;
			unsigned SMP5 :3;
			unsigned SMP6 :3;
			unsigned SMP7 :3;
			unsigned SMP8 :3;
			unsigned SMP9 :3;
		} smpr2;
		volatile uint32_t SMPR2;
	};
	volatile uint32_t JOFR1;
	volatile uint32_t JOFR2;
	volatile uint32_t JOFR3;
	volatile uint32_t JOFR4;
	volatile uint32_t HTR;
	volatile uint32_t LTR;
	union
	{
		volatile struct
		{
			unsigned SQ13 :5;
			unsigned SQ14 :5;
			unsigned SQ15 :5;
			unsigned SQ16 :5;
			unsigned L :4;
		} sqr1;
		volatile uint32_t SQR1;
	};
	union
	{
		volatile struct
		{
			unsigned SQ7 :5;
			unsigned SQ8 :5;
			unsigned SQ9 :5;
			unsigned SQ10 :5;
			unsigned SQ11 :5;
			unsigned SQ12 :5;
		} sqr2;
		volatile uint32_t SQR2;
	};
	union
	{
		volatile struct
		{
			unsigned SQ1 :5;
			unsigned SQ2 :5;
			unsigned SQ3 :5;
			unsigned SQ4 :5;
			unsigned SQ5 :5;
			unsigned SQ6 :5;
		} sqr3;
		volatile uint32_t SQR3;
	};
	union
	{
		volatile struct
		{
			unsigned JSQ1 :5;
			unsigned JSQ2 :5;
			unsigned JSQ3 :5;
			unsigned JSQ4 :5;
			unsigned JL :2;
		} jsqr;
		volatile uint32_t JSQR;
	};
	volatile uint32_t JDR1;
	volatile uint32_t JDR2;
	volatile uint32_t JDR3;
	volatile uint32_t JDR4;
	volatile uint32_t DR;
	
} ADC_Type;

