gokhangg/spectrum_analyzer_STM32F407/src/STM32F40xPeripherals.h
#undef ADC1
#undef ADC2
#undef ADC3
#define ADC1 ((ADC_Type*)ADC1_BASE)
#define ADC2 ((ADC_Type*)ADC2_BASE)
#define ADC3 ((ADC_Type*)ADC3_BASE)

typedef volatile struct
{
	/*!< ADC Common status register,                  Address offset: ADC1 base address + 0x300 */
	union
	{
		volatile struct
		{
			unsigned AWD1 :1;
			unsigned EOC1 :1;
			unsigned JEOC1 :1;
			unsigned JSTRT1 :1;
			unsigned STRT1 :1;
			unsigned RESERVED :2;
			unsigned AWD2 :1;
			unsigned EOC2 :1;
			unsigned JEOC2 :1;
			unsigned JSTRT2 :1;
			unsigned STRT2 :1;
			unsigned RESERVED2 :2;
			unsigned AWD3 :1;
			unsigned EOC3 :1;
			unsigned JEOC3 :1;
			unsigned JSTRT3 :1;
			unsigned STRT3 :1;
			unsigned RESERVED3 :2;
			
		} csr;
		volatile uint32_t CSR;
	};
	/*!< ADC common control register,                 Address offset: ADC1 base address + 0x304 */
	union
	{
		volatile struct
		{
			unsigned MULTI :4;
			unsigned RESERVED :3;
			unsigned DELAY :4;
			unsigned RESERVED2 :1;
			unsigned DDS :1;
			unsigned DMA :2;
			unsigned ADCPRE :2;
			unsigned RESERVED3 :4;
			unsigned VBATE :1;
			unsigned TSVREFE :1;
			
		} ccr;
		volatile uint32_t CCR;
	};
	/*!< ADC common regular data register for dual
	 AND triple modes,                            Address offset: ADC1 base address + 0x308 */
	union
	{
		volatile struct
		{
			
			unsigned short int DATA1;
			unsigned short int DATA2;
			
		} cdr;
		volatile uint32_t CDR;
	};
} ADC_Common_Type;

#undef ADC
#define ADC ((ADC_Common_Type*)(ADC1_BASE+0x300))

/********************************* TIM REGISTER DEFINITION REGION *********************************/
typedef struct
{
	
	union
	{
		volatile struct
		{
			unsigned short int CEN :1;
			unsigned short int UDIS :1;
			unsigned short int URS :1;
			unsigned short int OPM :1;
			unsigned short int DIR :1;
			unsigned short int CMS :2;
			unsigned short int ARPE :1;
			unsigned short int CKD :2;
			unsigned short int RESERVED :6;
			
		} cr1;
		volatile unsigned short int CR1;
	};
	volatile unsigned short int RESERVED0;

	union
	{
		volatile struct
		{
			unsigned short int RESERVED :3;
			unsigned short int CCDS :1;
			unsigned short int MMS :3;
			unsigned short int TI1S :1;
			unsigned short int RESERVED1 :8;
		} cr2;
		volatile unsigned short int CR2;
	};

	volatile unsigned short int RESERVED1;
	union
	{
		volatile struct
		{
			unsigned short int SMS :3;
			unsigned short int RESERVED :1;
			unsigned short int TS :3;
			unsigned short int MSM :1;
			unsigned short int ETF :4;
			unsigned short int ETPS :2;
			unsigned short int ECE :1;
			unsigned short int ETP :1;
		} smcr;
		volatile unsigned short int SMCR;
	};
	volatile unsigned short int RESERVED2;
	union
	{
		volatile struct
		{
			unsigned short int UIE :1;
			unsigned short int CC1IE :1;
			unsigned short int CC2IE :1;
			unsigned short int CC3IE :1;
			unsigned short int CC4IE :1;
			unsigned short int RESERVED :1;
			unsigned short int TIE :1;
			unsigned short int RESERVED1 :1;
			unsigned short int UDE :1;
			unsigned short int CC1DE :1;
			unsigned short int CC2DE :1;
			unsigned short int CC3DE :1;
			unsigned short int CC4DE :1;
			unsigned short int RESERVED2 :1;
			unsigned short int TDE :1;
		} dier;
		volatile unsigned short int DIER;
	};
	volatile unsigned short int RESERVED3;
	volatile unsigned short int SR;
	volatile unsigned short int RESERVED4;
	union
	{
		volatile struct
		{
			unsigned short int UG :1;
			unsigned short int CC1G :1;
			unsigned short int CC2G :1;
			unsigned short int CC3G :1;
			unsigned short int CC4G :1;
			unsigned short int RESERVED :1;
			unsigned short int TG :1;
		} egr;
		volatile unsigned short int EGR;
	};
	volatile unsigned short int RESERVED5;
	union
	{
		volatile struct
		{
			unsigned short int CC1S :2;
			unsigned short int OC1FE :1;
			unsigned short int OC1PE :1;
			unsigned short int OC1M :3;
			unsigned short int OC1CE :1;
			unsigned short int CC2S :2;
			unsigned short int OC2FE :1;
			unsigned short int OC2PE :1;
			unsigned short int OC2M :3;
			unsigned short int OC2CE :1;
		} ccmr1;
		volatile unsigned short int CCMR1;
	};
	volatile unsigned short int RESERVED6;
	union
	{
		volatile struct
		{
			unsigned short int CC3S :2;
			unsigned short int OC3FE :1;
			unsigned short int OC3PE :1;
			unsigned short int OC3M :3;
			unsigned short int OC3CE :1;
			unsigned short int CC4S :2;
			unsigned short int OC4FE :1;
			unsigned short int OC4PE :1;
			unsigned short int OC4M :3;
			unsigned short int OC4CE :1;
		} ccmr2;
		volatile unsigned short int CCMR2;
	};
	volatile unsigned short int RESERVED7;
	union
	{
		volatile struct
		{
			unsigned short int CC1E :1;
			unsigned short int CC1P :1;
			unsigned short int RESERVED :1;
			unsigned short int CC1NP :1;
			unsigned short int CC2E :1;
			unsigned short int CC2P :1;
			unsigned short int RESERVED1 :1;
			unsigned short int CC2NP :1;
			unsigned short int CC3E :1;
			unsigned short int CC3P :1;
			unsigned short int RESERVED2 :1;
			unsigned short int CC3NP :1;
			unsigned short int CC4E :1;
			unsigned short int CC4P :1;
			unsigned short int RESERVED3 :1;
			unsigned short int CC4NP :1;
		} ccer;
		volatile unsigned short int CCER;
	};

	volatile unsigned short int RESERVED8;

	union
	{
		volatile struct
		{
			unsigned short int BIT0 :1;
			unsigned short int BIT1 :1;
			unsigned short int BIT2 :1;
			unsigned short int BIT3 :1;
			unsigned short int BIT4 :1;
			unsigned short int BIT5 :1;
			unsigned short int BIT6 :1;
			unsigned short int BIT7 :1;
			unsigned short int BIT8 :1;
			unsigned short int BIT9 :1;
			unsigned short int BIT10 :1;
			unsigned short int BIT11 :1;
			unsigned short int BIT12 :1;
			unsigned short int BIT13 :1;
			unsigned short int BIT14 :1;
			unsigned short int BIT15 :1;
		} cnt;
		volatile unsigned int CNT;
	};

	volatile unsigned short int PSC;
	volatile unsigned short int RESERVED9;
	volatile uint32_t ARR;
	volatile unsigned short int RCR;
	volatile unsigned short int RESERVED10;
	volatile uint32_t CCR1;
	volatile uint32_t CCR2;
	volatile uint32_t CCR3;
	volatile uint32_t CCR4;
	volatile unsigned short int BDTR;
	volatile unsigned short int RESERVED11;
	union
	{
		volatile struct
		{
			unsigned short int DBA :5;
			unsigned short int RESERVED :3;
			unsigned short int DBL :5;
		} dcr;
		volatile unsigned short int DCR;
	};
	volatile unsigned short int RESERVED12;
	volatile unsigned short int DMAR;
	volatile unsigned short int RESERVED13;
	volatile unsigned short int OR;
	volatile unsigned short int RESERVED14;
} TIM_Type;

