gokhangg/spectrum_analyzer_STM32F407/src/STM32F40xPeripherals.h
#undef TIM1
#undef TIM2
#undef TIM3
#undef TIM4
#undef TIM5
#undef TIM6
#undef TIM7
#undef TIM8
#undef TIM12
#undef TIM13
#undef TIM14
#define TIM1                ((TIM_Type *) TIM1_BASE)
#define TIM2                ((TIM_Type *) TIM2_BASE)
#define TIM3                ((TIM_Type *) TIM3_BASE)
#define TIM4                ((TIM_Type *) TIM4_BASE)
#define TIM5                ((TIM_Type *) TIM5_BASE)
#define TIM6                ((TIM_Type *) TIM6_BASE)
#define TIM7                ((TIM_Type *) TIM7_BASE)
#define TIM8                ((TIM_Type *) TIM8_BASE)
#define TIM12               ((TIM_Type *) TIM12_BASE)
#define TIM13               ((TIM_Type *) TIM13_BASE)
#define TIM14               ((TIM_Type *) TIM14_BASE)

/********************************* FSMC REGISTER DEFINITION REGION *********************************/

typedef volatile struct
{
	/*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
	union
	{
		volatile struct
		{
			unsigned short int MBKEN :1;
			unsigned short int MUXEN :1;
			unsigned short int MTYP :2;
			unsigned short int MWID :2;
			unsigned short int FACCEN :1;
			unsigned short int RESERVED :1;
			unsigned short int BURSTEN :1;
			unsigned short int WAITPOL :1;
			unsigned short int WRAPMOD :1;
			unsigned short int WAITCFG :1;
			unsigned short int WREN :1;
			unsigned short int WAITEN :1;
			unsigned short int EXTMOD :1;
			unsigned short int ASYNCWAIT :1;
			unsigned short int RESERVED2 :3;
			unsigned short int CBURSTRW :1;
		} bcr1;
		volatile uint32_t BCR1;
	};
	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} btr1;
		volatile uint32_t BTR1;
	};
	union
	{
		volatile struct
		{
			unsigned short int MBKEN :1;
			unsigned short int MUXEN :1;
			unsigned short int MTYP :2;
			unsigned short int MWID :2;
			unsigned short int FACCEN :1;
			unsigned short int RESERVED :1;
			unsigned short int BURSTEN :1;
			unsigned short int WAITPOL :1;
			unsigned short int WRAPMOD :1;
			unsigned short int WAITCFG :1;
			unsigned short int WREN :1;
			unsigned short int WAITEN :1;
			unsigned short int EXTMOD :1;
			unsigned short int ASYNCWAIT :1;
			unsigned short int RESERVED2 :3;
			unsigned short int CBURSTRW :1;
		} bcr2;
		volatile uint32_t BCR2;
	};

	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} btr2;
		volatile uint32_t BTR2;
	};
	union
	{
		volatile struct
		{
			unsigned short int MBKEN :1;
			unsigned short int MUXEN :1;
			unsigned short int MTYP :2;
			unsigned short int MWID :2;
			unsigned short int FACCEN :1;
			unsigned short int RESERVED :1;
			unsigned short int BURSTEN :1;
			unsigned short int WAITPOL :1;
			unsigned short int WRAPMOD :1;
			unsigned short int WAITCFG :1;
			unsigned short int WREN :1;
			unsigned short int WAITEN :1;
			unsigned short int EXTMOD :1;
			unsigned short int ASYNCWAIT :1;
			unsigned short int RESERVED2 :3;
			unsigned short int CBURSTRW :1;
		} bcr3;
		volatile uint32_t BCR3;
	};

	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} btr3;
		volatile uint32_t BTR3;
	};
	union
	{
		volatile struct
		{
			unsigned short int MBKEN :1;
			unsigned short int MUXEN :1;
			unsigned short int MTYP :2;
			unsigned short int MWID :2;
			unsigned short int FACCEN :1;
			unsigned short int RESERVED :1;
			unsigned short int BURSTEN :1;
			unsigned short int WAITPOL :1;
			unsigned short int WRAPMOD :1;
			unsigned short int WAITCFG :1;
			unsigned short int WREN :1;
			unsigned short int WAITEN :1;
			unsigned short int EXTMOD :1;
			unsigned short int ASYNCWAIT :1;
			unsigned short int RESERVED2 :3;
			unsigned short int CBURSTRW :1;
		} bcr4;
		volatile uint32_t BCR4;
	};

	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} btr4;
		volatile uint32_t BTR4;
	};
	
} FSMC_Bank1_Type;

#undef FSMC_Bank1
#define FSMC_Bank1          ((FSMC_Bank1_Type*) FSMC_Bank1_R_BASE)

/**
 * @brief Flexible Static Memory Controller Bank1E
 */

typedef volatile struct
{
	/*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} bwtr1;
		volatile uint32_t BWTR1;
	};
	volatile uint32_t RESERVED;
	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} bwtr2;
		volatile uint32_t BWTR2;
	};
	volatile uint32_t RESERVED2;
	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} bwtr3;
		volatile uint32_t BWTR3;
	};
	volatile uint32_t RESERVED3;

	union
	{
		volatile struct
		{
			unsigned short int ADDSET :4;
			unsigned short int ADDHLD :4;
			unsigned short int DATAST :8;
			unsigned short int BUSTURN :4;
			unsigned short int CLKDIV :4;
			unsigned short int DATLAT :4;
			unsigned short int ACCMOD :2;
		} bwtr4;
		volatile uint32_t BWTR4;
	};
	
} FSMC_Bank1E_Type;

#undef FSMC_Bank1E
#define FSMC_Bank1E         ((FSMC_Bank1E_Type*) FSMC_Bank1E_R_BASE)

/**
 * @brief Flexible Static Memory Controller Bank2
 */

typedef volatile struct
{
	/*!< NAND Flash control register 2,                       Address offset: 0x60 */
	union
	{
		volatile struct
		{
			unsigned short int PWAITEN :1;
			unsigned short int PBKEN :1;
			unsigned short int PTYP :1;
			unsigned short int PWID :2;
			unsigned short int ECCEN :1;
			unsigned short int RESERVED :2;
			unsigned short int TCLR :4;
			unsigned short int TAR :4;
			unsigned short int ECCPS :3;
			
		} pcr2;
		volatile uint32_t PCR2;
	};
	/*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
	union
	{
		volatile struct
		{
			unsigned short int IRS :1;
			unsigned short int ILS :1;
			unsigned short int IFS :1;
			unsigned short int IREN :1;
			unsigned short int ILEN :1;
			unsigned short int IFEN :1;
			unsigned short int FEMPT :4;
		} sr2;
		volatile uint32_t SR2;
	};
	/*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
	union
	{
		volatile struct
		{
			unsigned short int MEMSET :8;
			unsigned short int MEMWAIT :8;
			unsigned short int MEMHOLD :8;
			unsigned short int MEMHIZ :8;
		} pmem2;
		volatile uint32_t PMEM2;
	};
	/*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
	union
	{
		volatile struct
		{
			unsigned short int ATTSET :8;
			unsigned short int ATTWAIT :8;
			unsigned short int ATTHOLD :8;
			unsigned short int ATTHIZ :8;
		} patt2;
		volatile uint32_t PATT2;
	};
	volatile uint32_t RESERVED; /*!< Reserved, 0x70                                                            */
	volatile uint32_t ECCR2; /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */
} FSMC_Bank2_Type;

#undef FSMC_Bank2
#define FSMC_Bank2          ((FSMC_Bank2_Type*) FSMC_Bank2_R_BASE)

/**
 * @brief Flexible Static Memory Controller Bank3
 */

typedef volatile struct
{
	/*!< NAND Flash control register 3,                       Address offset: 0x80 */
	union
	{
		volatile struct
		{
			unsigned short int PWAITEN :1;
			unsigned short int PBKEN :1;
			unsigned short int PTYP :1;
			unsigned short int PWID :2;
			unsigned short int ECCEN :1;
			unsigned short int RESERVED :2;
			unsigned short int TCLR :4;
			unsigned short int TAR :4;
			unsigned short int ECCPS :3;
			
		} pcr3;
		volatile uint32_t PCR3;
	};
	/*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
	union
	{
		volatile struct
		{
			unsigned short int IRS :1;
			unsigned short int ILS :1;
			unsigned short int IFS :1;
			unsigned short int IREN :1;
			unsigned short int ILEN :1;
			unsigned short int IFEN :1;
			unsigned short int FEMPT :4;
		} sr3;
		volatile uint32_t SR3;
	};
	/*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
	union
	{
		volatile struct
		{
			unsigned short int MEMSET :8;
			unsigned short int MEMWAIT :8;
			unsigned short int MEMHOLD :8;
			unsigned short int MEMHIZ :8;
		} pmem3;
		volatile uint32_t PMEM3;
	};
	/*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
	union
	{
		volatile struct
		{
			unsigned short int ATTSET :8;
			unsigned short int ATTWAIT :8;
			unsigned short int ATTHOLD :8;
			unsigned short int ATTHIZ :8;
		} patt3;
		volatile uint32_t PATT3;
	};
	uint32_t RESERVED; /*!< Reserved, 0x90                                                            */
	volatile uint32_t ECCR3; /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */
} FSMC_Bank3_Type;

#undef FSMC_Bank3
#define FSMC_Bank3          ((FSMC_Bank3_Type*) FSMC_Bank3_R_BASE)

/**
 * @brief Flexible Static Memory Controller Bank4
 */

typedef volatile struct
{
	/*!< PC Card  control register 4,                       Address offset: 0xA0 */
	union
	{
		volatile struct
		{
			unsigned short int PWAITEN :1;
			unsigned short int PBKEN :1;
			unsigned short int PTYP :1;
			unsigned short int PWID :2;
			unsigned short int ECCEN :1;
			unsigned short int RESERVED :2;
			unsigned short int TCLR :4;
			unsigned short int TAR :4;
			unsigned short int ECCPS :3;
			
