gokhangg/spectrum_analyzer_STM32F407/src/STM32F40xPeripherals.h
		} pcr4;
		volatile uint32_t PCR4;
	};
	/*!< PC Card  FIFO status and interrupt register 4,     Address offset: 0xA4 */
	union
	{
		volatile struct
		{
			unsigned short int IRS :1;
			unsigned short int ILS :1;
			unsigned short int IFS :1;
			unsigned short int IREN :1;
			unsigned short int ILEN :1;
			unsigned short int IFEN :1;
			unsigned short int FEMPT :4;
		} sr4;
		volatile uint32_t SR4;
	};
	/*!< PC Card  Common memory space timing register 4,    Address offset: 0xA8 */
	union
	{
		volatile struct
		{
			unsigned short int MEMSET :8;
			unsigned short int MEMWAIT :8;
			unsigned short int MEMHOLD :8;
			unsigned short int MEMHIZ :8;
		} pmem4;
		volatile uint32_t PMEM4;
	};
	/*!< PC Card  Attribute memory space timing register 4, Address offset: 0xAC */
	union
	{
		volatile struct
		{
			unsigned short int ATTSET :8;
			unsigned short int ATTWAIT :8;
			unsigned short int ATTHOLD :8;
			unsigned short int ATTHIZ :8;
		} patt4;
		volatile uint32_t PATT4;
	};
	/*!< PC Card  I/O space timing register 4,              Address offset: 0xB0 */
	union
	{
		volatile struct
		{
			unsigned short int IOTSET :8;
			unsigned short int IOTWAIT :8;
			unsigned short int IOTHOLD :8;
			unsigned short int IOTHIZ :8;
		} pio4;
		volatile uint32_t PIO4;
	};
} FSMC_Bank4_Type;

#undef FSMC_Bank4
#define FSMC_Bank4          ((FSMC_Bank4_Type*) FSMC_Bank4_R_BASE)

/********************************* SPI REGISTER DEFINITION REGION *********************************/
typedef volatile struct
{
	/*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
	union
	{
		volatile struct
		{
			unsigned short int CPHA :1;
			unsigned short int CPOL :1;
			unsigned short int MSTR :1;
			unsigned short int BR :3;
			unsigned short int SPE :1;
			unsigned short int LSBFIRST :1;
			unsigned short int SSI :1;
			unsigned short int SSM :1;
			unsigned short int RXONLY :1;
			unsigned short int DFF :1;
			unsigned short int CRCNEXT :1;
			unsigned short int CRCEN :1;
			unsigned short int BIDIOE :1;
			unsigned short int BIDIMODE :1;
		} cr1;
		volatile uint16_t CR1;
	};

	uint16_t RESERVED0; /*!< Reserved, 0x02
	 */
	/*!< SPI control register 2,                             Address offset: 0x04 */
	union
	{
		volatile struct
		{
			unsigned short int RXDMAEN :1;
			unsigned short int TXDMAEN :1;
			unsigned short int SSOE :1;
			unsigned short int RESERVED :1;
			unsigned short int FRF :1;
			unsigned short int ERRIE :1;
			unsigned short int RXNEIE :1;
			unsigned short int TXEIE :1;
		} cr2;
		volatile uint16_t CR2;
	};

	uint16_t RESERVED1; /*!< Reserved, 0x06                                                           */
	
	/*!< SPI status register,                                Address offset: 0x08 */
	union
	{
		volatile struct
		{
			unsigned short int RXNE :1;
			unsigned short int TXE :1;
			unsigned short int CHSIDE :1;
			unsigned short int UDR :1;
			unsigned short int CRCERR :1;
			unsigned short int MODF :1;
			unsigned short int OVR :1;
			unsigned short int BSY :1;
			unsigned short int TIFRFE :1;
		} sr;
		volatile uint16_t SR;
	};

	uint16_t RESERVED2; /*!< Reserved, 0x0A                                                           */
	
	/*!< SPI data register,                                  Address offset: 0x0C */
	union
	{
		volatile struct
		{
			unsigned char DR :8;
		} dr;
		volatile uint16_t DR;
	};

	uint16_t RESERVED3; /*!< Reserved, 0x0E                                                           */
	__IO
	uint16_t CRCPR; /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
	uint16_t RESERVED4; /*!< Reserved, 0x12                                                           */
	__IO
	uint16_t RXCRCR; /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
	uint16_t RESERVED5; /*!< Reserved, 0x16                                                           */
	__IO
	uint16_t TXCRCR; /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
	uint16_t RESERVED6; /*!< Reserved, 0x1A                                                           */
	
	/*!< SPI_I2S configuration register,                     Address offset: 0x1C */
	union
	{
		volatile struct
		{
			unsigned short int CHLEN :1;
			unsigned short int DATLEN :2;
			unsigned short int CKPOL :1;
			unsigned short int I2SSTD :2;
			unsigned short int RESERVED :1;
			unsigned short int PCMSYNC :1;
			unsigned short int I2SCFG :2;
			unsigned short int I2SE :1;
			unsigned short int I2SMOD :1;
		} i2scfgr;
		volatile uint16_t I2SCFGR;
	};

	uint16_t RESERVED7; /*!< Reserved, 0x1E                                                           */
	
	/*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
	union
	{
		volatile struct
		{
			unsigned short int I2SDIV :8;
			unsigned short int ODD :1;
			unsigned short int MCKOE :1;
		} i2spr;
		volatile uint16_t I2SPR;
	};

	uint16_t RESERVED8; /*!< Reserved, 0x22                                                           */
} SPI_Type;

#undef I2S2ext
#undef SPI2
#undef SPI3
#undef I2S3ext
#undef SPI1

#define I2S2ext             ((SPI_Type*) I2S2ext_BASE)
#define SPI2  			((SPI_Type*) SPI2_BASE)
#define SPI3            ((SPI_Type*) SPI3_BASE)
#define I2S3ext            ((SPI_Type*) I2S3ext_BASE)
#define SPI1         ((SPI_Type*) SPI1_BASE)

#endif

